# Lesson 2 - Pandas

* __objective__: Review core `pandas` objects:
    * `pandas.Series`
    * `pandas.Dataframe`
    
## Intro to `pandas`
* python package to wrangle and anylyze abulkar data
* built on top of np
* core tool dor data analysis in Python

In [6]:
#import pandas and numpy
import pandas as pd
import numpy as np

## Panda Series
 
A `pandas.Series`:
* one of the core data structures in `pandas`
* 1-D array of indexed data
* Will be the columns of the `pandas.DataFrame`

__Creating a pandas Series__

There are severay ways of creating a series, but we will use the follwing method:

s = p.Series (data, index=index)
* data = numpy array
* index = a list of indeces of the same length as data

In [7]:
# making a series from a np array
np.arange(3) #arrange function constructs an array of consecutive integers

array([0, 1, 2])

In [8]:
# we can use this to create a pandas series
pd.Series(np.arange(3), index = ['a','b','c'])

a    0
b    1
c    2
dtype: int64

__Q__: What kind of parameter is `index`?

__A__: An optional parameter, it has a default to index from 0.

_Example_:

In [ ]:
# Create a series from a list of strings w/the default index

## Operations on a Series

Arithmetic operations work on series.

Example: Divide values in a series by 10

In [9]:
# define a series
s = pd.Series([98, 73, 65], index = ['Andrea', 'Beth', 'Carol'])
print(s, '\n')

#divide each element in the series by 10
print(s/10)

Andrea    98
Beth      73
Carol     65
dtype: int64

Andrea    9.8
Beth      7.3
Carol     6.5
dtype: float64

__Example__: Create a new series with `True/False` values indicating whether the elements in the series satisfy a condition or not.

Using conditions on Series is key for selecting data from data frames.

In [10]:
# view which values in our series, s, are greater than 70
s > 70

Andrea     True
Beth       True
Carol     False
dtype: bool

## Missing values
Identifying missing values:
* missing values in `pandas` are represented by `np.Nan`
    * where Nan = not a number
* `NaN` is a type of float in numpy

In [11]:
# create a data series with missing values
s = pd.Series([1,2, np.NaN, 4, np.NaN])

# check if there are NaNs within the series
s.hasnans

True

`isna()` = a method of series, returns a series indicating which elements are NAs:

In [12]:
# this will print True for all NaNs
# data type is `bool` to denote a boolean value
s.isna()

0    False
1    False
2     True
3    False
4     True
dtype: bool

## Intro to Data Frames

`pandas.DataFrame`:
* most used object in `pandas`
* represents tabular data (think spreadhseet)
* each column is a `pandas.Series`

## Creating `pandas.DataFrame`

Can create dataframes using dictionaries.
* Dictionaries contains sets of key-value pairs
    * key = column name
    * value = column values

```Python
{
    key1: value1,
    key2: value2
}
```

_Example_: Create a pd dataframe using a dictionary

In [13]:
# create dictionary with columns data
d = {'col_name_1': np.arange(3),
    'col_name_2': [3.1,3.2,3.3]}

print(d)

{'col_name_1': array([0, 1, 2]), 'col_name_2': [3.1, 3.2, 3.3]}

In [14]:
# create a dataframe, setting the dictionary as the only parameter
df = pd.DataFrame(d)
df

   col_name_1  col_name_2
0           0         3.1
1           1         3.2
2           2         3.3

## In-place Operations

We can use a dataframe _method_ called `rename` in order to rename the columns.

```Python
{old_col_name: new_col_name,
old_col_name_2: new_col_name_2}
```

Examaple: New column names

In [15]:
# define new column names
col_names = {'col_name_1': 'col1',
            'col_name_2': 'col2'}

# use rename function to change column names
df.rename(columns = col_names)

   col1  col2
0     0   3.1
1     1   3.2
2     2   3.3

In [16]:
# the rename function does not modify the object itself
print(df) #printing df will not demonstrate changes above

# Assign output in order to store changes, using the same name to override
df = df.rename(columns = col_names)
print(df)

   col_name_1  col_name_2
0           0         3.1
1           1         3.2
2           2         3.3
   col1  col2
0     0   3.1
1     1   3.2
2     2   3.3

There are also parameters you can use to modify the dataframe itself.
* Not recommended, you can lose connection to the original data
```Python
df.rename(columns = col_names, inplace = True)
```

## Subsetting a pd.DataFrame

Read in Data

In [18]:
# read in file
df = pd.read_csv('/Users/bbarajas429/eds-220/eds-220-lesson2-pandas/glacial_loss.csv')

# see the first five rows
df.head()

,year,europe,arctic,alaska,asia,north_america,south_america,antarctica,global_glacial_volume_change,annual_sea_level_rise,cumulative_sea_level_rise
0,1961,-5.128903,-108.382987,-18.721190,-32.350759,-14.359007,-4.739367,-35.116389,-220.823515,0.610010,0.610010
1,1962,5.576282,-173.252450,-24.324790,-4.675440,-2.161842,-13.694367,-78.222887,-514.269862,0.810625,1.420635
2,1963,-10.123105,-0.423751,-2.047567,-3.027298,-27.535881,3.419633,3.765109,-550.575640,0.100292,1.520927
3,1964,-4.508358,20.070148,0.477800,-18.675385,-2.248286,20.732633,14.853096,-519.589859,-0.085596,1.435331
4,1965,10.629385,43.695389,-0.115332,-18.414602,-19.398765,6.862102,22.793484,-473.112003,-0.128392,1.306939

In [19]:
# View column names
df.columns

Index(['year', 'europe', 'arctic', 'alaska', 'asia', 'north_america',
       'south_america', 'antarctica', 'global_glacial_volume_change',
       'annual_sea_level_rise', 'cumulative_sea_level_rise'],
      dtype='object')

In [20]:
# check the data types of each column
df.dtypes

year                              int64
europe                          float64
arctic                          float64
alaska                          float64
asia                            float64
north_america                   float64
south_america                   float64
antarctica                      float64
global_glacial_volume_change    float64
annual_sea_level_rise           float64
cumulative_sea_level_rise       float64
dtype: object

In [21]:
# data frame's shape: output is a tuple (# rows, # columns)
df.shape

(43, 11)

In [22]:
# seelect a single column by using square brackets []
annual_rise = df['annual_sea_level_rise']

# check the type of the ouput
print(type(annual_rise))

annual_rise.head()

<class 'pandas.core.series.Series'>

0    0.610010
1    0.810625
2    0.100292
3   -0.085596
4   -0.128392
Name: annual_sea_level_rise, dtype: float64

## Selecting a Single Column w/Attribute Syntax
Do so using `df.column_name`

In [23]:
annual_rise_2 = df.annual_sea_level_rise #creates new df with only the one column
annual_rise_2.head()

0    0.610010
1    0.810625
2    0.100292
3   -0.085596
4   -0.128392
Name: annual_sea_level_rise, dtype: float64

## Selecting Mult. Columns Using a List of Column Names

The syntac for selecting multiple columnd using a list of column names is:

```Python
df[['col1', 'col2', 'col3']]
```

The list of column names goes inside the selection brackets `[]` which is why there's double brackets. Each column name is a string.

__Example__: Select change in glacial volume only in Europe and Asia

In [25]:
# select columns w/name 'europe' and 'asia'
europe_asia = df[['europe', 'asia']]

# print type of resulting selection
print(europe_asia)

#check the shape of the selection, should be 2 col
print(europe_asia.shape)

# see or selection
europe_asia

       europe       asia
0   -5.128903 -32.350759
1    5.576282  -4.675440
2  -10.123105  -3.027298
3   -4.508358 -18.675385
4   10.629385 -18.414602
5   -4.127241 -14.630284
6   12.787533 -39.013695
7    6.927000   7.879589
8  -11.732735 -16.038797
9   -6.452316 -36.120199
10   0.414711  -8.702938
11  -5.144729 -40.883357
12   4.081090 -31.432594
13   1.545615 -43.861622
14   7.431192 -43.357442
15   3.986753 -67.292125
16   4.891410 -62.165684
17   8.404591 -22.858040
18   3.916703 -49.242043
19  -0.858775 -21.874220
20   8.161363 -39.471806
21  -1.178121 -18.119898
22   3.721357 -45.011231
23   8.581427 -20.528535
24  -5.970980 -31.571622
25  -5.680642 -18.920773
26   8.191477 -41.121970
27 -11.117228 -21.300712
28  14.863220 -46.528372
29  -1.226009 -35.553433
30 -14.391425 -15.338299
31  16.175828   9.582169
32  16.685013 -65.995130
33   0.741751 -59.004710
34  -2.139665   3.500155
35  -6.809834 -67.436591
36 -13.724106 -34.406403
37 -13.083338 -58.115702
38  -8.039555 -26.211723
39 -17.008590 -37.518173
40  -8.419109 -35.977022
41  -3.392361 -36.127226
42  -3.392361 -36.021991
(43, 2)

       europe       asia
0   -5.128903 -32.350759
1    5.576282  -4.675440
2  -10.123105  -3.027298
3   -4.508358 -18.675385
4   10.629385 -18.414602
5   -4.127241 -14.630284
6   12.787533 -39.013695
7    6.927000   7.879589
8  -11.732735 -16.038797
9   -6.452316 -36.120199
10   0.414711  -8.702938
11  -5.144729 -40.883357
12   4.081090 -31.432594
13   1.545615 -43.861622
14   7.431192 -43.357442
15   3.986753 -67.292125
16   4.891410 -62.165684
17   8.404591 -22.858040
18   3.916703 -49.242043
19  -0.858775 -21.874220
20   8.161363 -39.471806
21  -1.178121 -18.119898
22   3.721357 -45.011231
23   8.581427 -20.528535
24  -5.970980 -31.571622
25  -5.680642 -18.920773
26   8.191477 -41.121970
27 -11.117228 -21.300712
28  14.863220 -46.528372
29  -1.226009 -35.553433
30 -14.391425 -15.338299
31  16.175828   9.582169
32  16.685013 -65.995130
33   0.741751 -59.004710
34  -2.139665   3.500155
35  -6.809834 -67.436591
36 -13.724106 -34.406403
37 -13.083338 -58.115702
38  -8.039555 -26.211723
39 -17.008590 -37.518173
40  -8.419109 -35.977022
41  -3.392361 -36.127226
42  -3.392361 -36.021991

## Selecting Multiple Columns (Using Slice)

We'll use `loc` selection and syntax as seen below. __Remember Python uses 0-indexing__

```Python
df.loc[ row-selection, column-selection]
```
* row-selection = rows we want to subset from the df
* column-selection = columns we want to subset from the df

__Example__: Select all columns b/w Europe and Antarctica
    Helpful to read periods as "and then." In the code below we are saying "take my dataframe _and then_ select these rows _and then_ show me the head of the selected df"

In [29]:
df.loc[ : , 'europe':'antarctica'].head() # helpful to read periods as "and then"

,europe,arctic,alaska,asia,north_america,south_america,antarctica
0,-5.128903,-108.382987,-18.721190,-32.350759,-14.359007,-4.739367,-35.116389
1,5.576282,-173.252450,-24.324790,-4.675440,-2.161842,-13.694367,-78.222887
2,-10.123105,-0.423751,-2.047567,-3.027298,-27.535881,3.419633,3.765109
3,-4.508358,20.070148,0.477800,-18.675385,-2.248286,20.732633,14.853096
4,10.629385,43.695389,-0.115332,-18.414602,-19.398765,6.862102,22.793484

Notes about this:
* `row-selection` = `:` means that we want to select all the rows
* `column-selection` = slice `europe:antarctica` means we want all columns between europe and antarctica
* We get both ends of the slice in the selected df. Different from slicing in base python and NumpY, where the endpoint is _not_ included in slive.

### Check-In: Practice Subsetting the Desired Rows
Select the following from `df`:
* the year data
* data from Arctic, Alaska, Asia and North America
* the global change in glacial volume and cumulative sea rise

In [30]:
# select only the year data
year = df['year']
year.head()

0    1961
1    1962
2    1963
3    1964
4    1965
Name: year, dtype: int64

In [36]:
# select data from Arctic, Alaska, Asia and North America
df.loc[ : , 'arctic':'north_america'].head() #this is the 'slice' method

       arctic     alaska       asia  north_america
0 -108.382987 -18.721190 -32.350759     -14.359007
1 -173.252450 -24.324790  -4.675440      -2.161842
2   -0.423751  -2.047567  -3.027298     -27.535881
3   20.070148   0.477800 -18.675385      -2.248286
4   43.695389  -0.115332 -18.414602     -19.398765

In [39]:
# view column names to copy/pase
df.columns

# the global change in glacial volume and cumulative sea rise
df[['global_glacial_volume_change', 'cumulative_sea_level_rise']].head()

   global_glacial_volume_change  cumulative_sea_level_rise
0                   -220.823515                   0.610010
1                   -514.269862                   1.420635
2                   -550.575640                   1.520927
3                   -519.589859                   1.435331
4                   -473.112003                   1.306939

## Selecting Rows

### Select Rows Using a Condition

General syntax: 
```Python
df[condition_on_rows]
```

__Example 1__: We want to view data collected after 1996.

In [41]:
#select all rows with year > 1996
df[ df['year'] > 1996 ]

,year,europe,arctic,alaska,asia,north_america,south_america,antarctica,global_glacial_volume_change,annual_sea_level_rise,cumulative_sea_level_rise
36,1997,-13.724106,-24.832246,-167.229145,-34.406403,-27.680661,-38.213286,-20.179090,-4600.686013,0.909625,12.709077
37,1998,-13.083338,-110.429302,-107.879027,-58.115702,30.169987,-3.797978,-48.129928,-4914.831966,0.867807,13.576884
38,1999,-8.039555,-64.644068,-87.714653,-26.211723,5.888512,-8.038630,-40.653001,-5146.368231,0.639603,14.216487
39,2000,-17.008590,-96.494055,-44.445000,-37.518173,-29.191986,-2.767698,-58.873830,-5435.317175,0.798202,15.014688
40,2001,-8.419109,-145.415483,-55.749505,-35.977022,-0.926134,7.553503,-86.774675,-5764.039931,0.908074,15.922762
41,2002,-3.392361,-48.718943,-87.120000,-36.127226,-27.853498,-13.484593,-30.203960,-6013.225500,0.688358,16.611120
42,2003,-3.392361,-48.718943,-67.253634,-36.021991,-75.066475,-13.223430,-30.203960,-6289.640976,0.763579,17.374699

Example 1 breakdown:
* The condition = `df[year] > 1996` checks which rows have a value greater than 1996 in the `year` column 
    * if you were to print only this condition, it creates a series that prints T/F
    * this is a `pd.Series` with boolean values (T/F), often called __masks__
* When the mask is inputed within selection brackets `[]` we keep all rows within the pd.Series that are `True`

__Example 2__: Select data from 1970 o 1979 (including 79)
* use `isin()` to check if values are between a range

In [42]:
# want to select rows by conditions
df[ df.year.isin( range(1970, 1980) ) ]

,year,europe,arctic,alaska,asia,north_america,south_america,antarctica,global_glacial_volume_change,annual_sea_level_rise,cumulative_sea_level_rise
9,1970,-6.452316,-24.494667,-0.125296,-36.120199,11.619790,11.636911,4.400377,-999.018177,0.110225,2.759719
10,1971,0.414711,-42.904189,28.103328,-8.702938,-9.964542,1.061299,-6.735536,-1038.104459,0.107973,2.867692
11,1972,-5.144729,-27.004031,-22.143350,-40.883357,32.363730,-14.968034,-6.223849,-1122.885506,0.234202,3.101894
12,1973,4.081090,9.839444,22.985188,-31.432594,-20.883232,2.103649,10.539823,-1125.677743,0.007713,3.109607
13,1974,1.545615,-40.126998,-29.517874,-43.861622,-23.991402,-21.338825,4.419343,-1279.964287,0.426206,3.535813
14,1975,7.431192,-32.410467,-44.094084,-43.357442,-30.858810,-2.368842,-7.775315,-1434.818037,0.427773,3.963586
15,1976,3.986753,21.686639,-28.234725,-67.292125,-12.534421,-19.465358,19.250607,-1518.185129,0.230296,4.193882
16,1977,4.891410,-33.123010,-5.662139,-62.165684,-15.905332,2.654950,-23.727249,-1652.453400,0.370907,4.564788
17,1978,8.404591,-77.561015,-12.503384,-22.858040,-31.097609,7.127708,-9.140167,-1791.355022,0.383706,4.948495
18,1979,3.916703,-88.351684,-63.938851,-49.242043,-12.076624,-17.718503,-9.578557,-2030.537848,0.660726,5.609221